title: Encoded PowerShell Command
id: blueteam-rule-002
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains: 'powershell -enc'
  condition: selection
level: medium